const TermsOfService = () => {
  return (
    <div className="mt-16 mb-20 w-80 mx-auto text-xs space-y-4 leading-relaxed">
      <div>
        <h1 className="font-semibold text-base text-center py-6">利用規約</h1>
        <p className="">CanMeet（以下、「当サイト」とします）内のコンテンツをご利用される場合、下記の利用規約（以下、「当規約」とします）に同意していただく必要があります。従って、当サイト内のコンテンツをご利用いただく場合、当規約の内容を承諾していただいたものとみなされます。<br />また、当規約は事前の告知なく変更・中止する場合がありますので、ご利用の際には必ず当規約をご参照ください。変更後、当サイト内のコンテンツを継続してご利用される場合は、変更後の規約もご承諾いただいたものとみなします。</p>
      </div>
      <div>
        <h3 className="font-medium">1. 当サイトの目的</h3>
        <p>当サイトは、カナダに住んでいる日本人がより安心して・より良い価格で、買えるモノ・売れる機会を提供します。</p>
      </div>
      <div>
        <h3 className="font-medium">2. 禁止行為</h3>
        <p>下記項目に該当する投稿はご遠慮下さい。当サイトで、これに該当する可能性があると判断した場合は、投稿者への事前の通知なく、関連する一部あるいは全ての投稿を移動・変更・削除・停止する場合があります。</p>
        <div className="my-4 text-xxs">
          <p>- 当サイト・当サイトの利用者・第三者の著作権侵害</p>
          <p>- 当サイト・当サイトの利用者・第三者に対する著しい誹謗、中傷</p>
        </div>
      </div>
      <div>
        <h3 className="font-medium">3. 売買禁止項目</h3>
        <div className="my-4 text-xxs">
          <p>- 大麻などの違法薬物</p>
        </div>
      </div>
      <div>
        <h3 className="font-medium">3. 免責・責任条項</h3>
        <p>掲載内容についての信用性・正確性等の判断は、各利用者が自己の責任で行うものとし、掲載内容に起因して利用者が損害を被った場合でも、理由の如何を問わず、当サイトでは一切の責任を負いません。また、当サイトでは、掲載内容の監視義務を負うものではありません。システムトラブルなどの事故、開発上の都合、削除申請などにより、登録されていたデータが消去されても、復旧の責任を負いません。また、必要に応じて、IPアドレス等、アクセス情報を開示することがあります。</p>
      </div>
      <div>
        <h3 className="font-medium">4. 投稿制限措置</h3>
        <p>利用規約違反を多く行っている場合、事前の予告無く、当該パソコンを投稿制限措置にする場合があります。その後、同一パソコン（同一利用者）と思われる方による別IPアドレスからの投稿が見つかった場合、再度投稿制限措置や削除対応をする場合があります。</p>
      </div>
      <div>
        <h3 className="font-medium">5. </h3>
        <p>携帯電話や薬の売買を行う場合、その利用者はカナダ国内在住者に限定いたします。</p>
      </div>
      <div>
        <h3 className="font-medium">6. 付記 </h3>
        <p>当規約は、2024年5月◯日から実施いたします。</p>
      </div>
    </div>
  )
}

export default TermsOfService